Revit 2027 API
UIDocument.UpdateAllOpenViews Method
 Update all open views in this document after elements have been changed, deleted, selected or de-selected. Graphics in the views are fully redrawn regardless of which elements have changed.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void UpdateAllOpenViews()
Public Sub UpdateAllOpenViews
public:
void UpdateAllOpenViews()
member UpdateAllOpenViews : unit -> unit
Remarks
 This function should only rarely be needed, but might be required when working with graphics drawn from outside of Revit's transactions and elements, for example, when using IDirectContext3DServer. This function is potentially expensive as many views may be updated at once, including regeneration of view's geometry and redisplay of graphics. Thus for most situations it is recommended that API applications rely on the Revit application framework to update views more deliberately.
See Also
Reference
UIDocument Class
Autodesk.Revit.UI Namespace